<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>개요</title>
</head>
<body>
<h1>개요</h1>
<p>답십리라는 명칭에는 여러 가지 유래설이 있다. 
조선초 무학대사가 도읍을 정하려고 이곳을 밟았다 하여 답심리(踏尋里)로 불렸다는 것과 흥인지문으로부터 10리가 떨어진 곳이라고 하여, 
왕십리와 같이 답십리라고 불렀다는 설, 그리고 청계천 하류지역이었던 이 지역의 들(논:畓)이 10리벌 같이 넓어서 답십리(畓→ 踏十里)로 되었다는 설이다. 
이곳은 1751년 영조 27년 한성부 동부 인창방 답십리계였다가, 1911년 4월 경성부 인창면으로 편입되었고, 1914년 4월 경기도 고양군 숭인면으로 편입되었다. 1936년 4월에는 경성부 답십리정이 되었고, 1943년 4월 1일 구제를 시작하면서 동대문구에 편입되어, 동대문구 답십리정으로 개칭하였다. 
해방 후 1946년 10월 1일 일제식 명칭인 ‘정’을 없애고, 동대문구 답십리동으로 개칭하였다.
1970년 5월 18일 동대문구 답십리3동이 신설되었고, 2008년 8월 11일에는 답십리3동과 5동을 통합하였다. 2009년 5월 4일에는 1동과 3동을 통합하여 2개의 동만 남게 되었다.
</p>
</body>
</html>